app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:song].path, headers: true) do |song|
      artist = Artist.find_or_create_by(name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-11-27 03:31:35.120691"], ["updated_at", "2018-11-27 03:31:35.120691"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-11-27 03:31:35.123264"], ["updated_at", "2018-11-27 03:31:35.123264"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]